# CreateSky Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewDisplayBackground..::..CreateSky Method
ViewDisplayBackground Class See Also
---
Creates an object that can be passed to View.SetBackground method to set the background of the SunAndClouds type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public static ViewDisplayBackground CreateSky()
```

Visual Basic
---
```text
Public Shared Function CreateSky As ViewDisplayBackground
```

Visual C++
---
```text
public:
static ViewDisplayBackground^ CreateSky()
```

# ### Return Value
New background object to pass to View.SetBackground.
# See Also
ViewDisplayBackground Class
Autodesk.Revit.DB Namespace